import React from 'react';
import useStyles from './contract-signing.css';
import SignatureCanvas from 'react-signature-canvas'
import {Grid} from '@material-ui/core';

export default ({ ip }) => {
    const classes = useStyles();
    let current_datetime = new Date()
    const date = current_datetime.getFullYear() + "-" + (current_datetime.getMonth() + 1) + "-" + current_datetime.getDate();
    const {name, performer} = ip;
    
    return (
        <Grid container direction='column'>
תאריך: <b>{date}</b>

לכב' <b>כאן יהיה שם יוזר</b>
(להלן: "המזמין")
הנדון: רכישת רישיון שימוש ל <b>{name}</b>
בהמשך לפנייתך אלי בבקשה ליצור עבורך את הציורים / איורים / קומיקס / עיצובים / הר"מ (להלן: "היצירות") וזאת לצורך פרסומם ומסחורם להלן פירוט תנאי ההתקשרות בינינו ותנאי השימוש ביצירות:
שם היצירה: <b>{name}</b>.
המבצע: <b>{performer}</b> .
כמות האיורים: __________________________________________________.
גודל: ____x____ מימדים: דו מימד/תלת מימד.
פורמט דיגיטלי: gif / tif / jpg / pdf
מועד משוער למסירת האיורים למזמין:  _________________________________________.
מהות ההתקשרות: שירותי יצירה ורישיון מוגבל לשימוש ביצירות בתנאים הר"מ;
אופי הרישיון: בלעדי / בלתי בלעדי / בלעדי מוגבל בזמן למשך     חודשים ולאחריו בלתי בלעדי;
תקופת הרישיון: (שימוש או פרסום חד-פעמי / פרסום מוגבל למספר מהדורות או מספר עותקים / פרסום מוגבל בזמן / פרסום בלתי מוגבל);
מדיות ושימושים מותרים – כמפורט בנספח א' להסכם זה;
טריטוריה בה מותר הפרסום: בישראל בלבד / אחר: _____________________;
התמורה: המזמין ישלם ליוצר תמורה בשכר שירותים בסך של _______ ₪ בתוספת מע"מ כשכר שירותים / וכן ובנוסף, תמלוגים בשיעור של _______(-____ אחוז) בתוספת מע"מ מסך כלל ההכנסות שיתקבלו בכלל בקשר לאותה יצירה שבה תשולבנה היצירות המוזמנות (הכנסות הספר / הסרט / הסדרה / מוצר הלוואי). השכר ישולם בין אם יעשה המזמין ביצירות שימוש ובין אם לא.
מועדי תשלום שכר השירותים: ישולם בשלבים על פי התקדמות העבודה, כדלהלן:
30% מהתמורה תשולם במועד אישור הסכם זה בידי המזמין, כתנאי להתחלת היצירה בידי היוצר;
40% מהתמורה תשולם תוך שבעה ימים מיום משלוח הודעת היוצר על סיום הכנת סקיצות שחור/לבן של היצירה;
30% מסך התמורה (היתרה) תשולם עם מתן הודעת היוצר על השלמת היצירה.
תשלום יבוצע ע"פ דרישת תשלום מהיוצר שלאחר פירעונה תשלח קבלה/חשבונית מתאימה יחד אם אישור על ניכוי מס במקור ואישור על ניהול ספרים ו/או אישור על תיאום מס.
מסירת האיורים למזמין: היוצר יעביר למזמין עותקים ברזולוציה גבוהה של היצירות בפורמט מוכנים לשימוש בתוך 24 שעות מעת קבלת התשלום האחרון. המזמין לא יהיה רשאי לעשות שימוש ביצירה בטרם נפרעה מלוא התמורה על פי הסכם זה.
מועדי תשלום תמלוגים ודווח: המזמין מתחייב לדווח ליוצר ולבצע את התשלומים המגיעים לו מהכנסות היצירה, פעם ברבעון קלאנדרי ולתן פעם בשנה קלנדרית ולא יאוחר מתאריך 31 לחודש אפריל של כל שנה דו"ח מאושר על ידי רואה חשבון של המזמין ובו תפורט סך ההכנסה ומקורה, התאריך שבו התקבלה ואופן חישוב אחוזי היוצר.
מתן חשבונות: ליוצר ו/או למי מטעמו תהא הזכות לקבל העתקים מהסכמים מדוחו"ת ההפצה של היצירות כפי שיתקבלו ממפיצי המוצרים וכן יהיה זכאי לבדוק את ספרי החשבונות ולבקש מהמזמין המצאת פרטים נוספים או מידע משלים ביחס לשימוש המסחרי שנעשה ביצירות.
תנאי השימוש: המזמין מתחייב לעשות שימוש בהתאם לרישיון המוענק לו על פי הסכם זה בלבד ולא לחרוג ממנו. המזמין אינו רשאי לעשות ביצירה כל שימוש  נוסף או אחר מלבד השימושים המצוינים לעיל ולא לעשות מהיצירה העתקה ו/או יצירה נגזרת מכל מין וסוג שהוא לרבות העברת היצירה למדיות – אחרות ללא אישור היוצר בכתב ומראש של היוצר ויעשה כן רק לאחר שסוכמו עם היוצר תנאי השימוש החדשים.
הסתמכות על יצירות אחרות: במידה ויידרש היוצר על ידי המזמין להסתמך ו/או לעשות שימוש ביצירות אחרות ו/או תמונות ו/או חומרים שונים אשר אינם פרי יצירתו המקורית ואשר יימסרו לו על ידי המזמין, יהיה המזמין אחראי לקבלת הרשות מבעלי זכויות היוצרים בחומרים אלה.
זכויות יוצרים: היוצר יישאר בעלים בלעדי של מלוא זכויות היוצרים ביצירות. ליוצר שמורה הזכות לעשות בעצמו כל שימוש ביצירות לרבות פרסום לצורך קידומו בכל דרך, עשיית עיבודים או יצירות נגזרות ו/או העברה למדיה אחרת ו/או כל שימוש אחר בהתאם לרשיון המוענק למזמין בהסכם זה, וזאת תוך התחשבות ושמירה על זכויותיו של המזמין בהתאם לרישיון המוענק לו על פי הסכם זה.
אזכור: המזמין מתחייב לאזכר את שם היוצר על המוצר, על עטיפת המוצר ו/או בכריכתו באופן בולט וברור כמקובל באותה מדיה. במידה ותופץ היצירה לחו"ל יתורגם הקרדיט לשפה הנכונה.
שינויים: כל שינוי ביצירה (בגודל, צבע וכו') מחייב את הסכמת היוצר בכתב ומראש ויעשה על ידי היוצר בלבד. תיקונים במהלך העבודה ושינויים שיתבקשו לאחר אישורי סקיצות יתומחרו על פי שעות עבודה בנפרד. כל שעת עבודה תתומחר על פי כמות העבודה הדרושה ובהתאם למורכבות השינויים הנדרשים.
עותקי חינם: המזמין יעניק ליוצר 5 (חמישה) עותקים של המוצר לאחר הוצאתו לאור, ללא תשלום והיוצר יהיה זכאי לרכוש עותקים נוספים של המוצר במחיר עלות.
ביטול ההזמנה: במקרה שהמזמין ירצה לבטל הזמנה זו עליו להודיע על כך ליוצר בהקדם האפשרי. במקרה זה יהיה היוצר זכאי לשכר בגין השלב אליו הגיע בביצוע האיורים על פי הסכם זה. ביטול הזמנת העבודה עשרה ימים לפני המועד שנקבע למסירת האיורים יחויב בתשלום מלוא התמורה. במקרה בו היוצר ירצה לבטל הזמנה זו, עליו להודיע על כך למזמין בהקדם האפשרי. במקרה זה יהיה זכאי המזמין לקבל מהיוצר את האיור ו/או סקיצה (אף אם אינה מוגמרת) והיוצר יהיה זכאי לשכר בגין השלב אליו הגיע בביצוע האיור.
הפרות: הוראות חוק החוזים (תרופות) התשל"א 1973 וחוק זכויות יוצרים – 2007 יחולו במקרה של הפרת הסכם זה. יעשה המזמין שימוש החורג מהיקף הרישיון המוענק לו על פי הסכם זה ללא רשותו בכתב של היוצר, יהווה הדבר הפרה של זכויות היוצרים של היוצר לכל דבר ועניין ויזכה את היוצר במלוא הפיצויים הקבועים בחוק זה וזאת מבלי לפגוע בכל סעד ו/או תרופה אחרת העומדת לו על פי כל דין.
איחור בתשלומים: כל סכום הקבוע בהסכם זה שלא ישולם במועדו, יישא ריבית בשיעור הריבית המקסימלית הנהוגה בגין חריגה בלתי מאושרת ממסגרת אשראי בחשבונות חח"ד בבנק לאומי לישראל.
מובהר כי בין הצדדים לא יחולו יחסי עובד מעביד.
בכל מחלוקת הקשורה להזמנה זו, תהייה הסמכות נתונה לבתי המשפט בעיר תל-אביב.

            <p>אנא חתום שאתה מאשר את הדברים:</p>
            <div className={classes.signature}>
                <SignatureCanvas backgroundColor='#c5e1a5'></SignatureCanvas>
            </div>
        </Grid>
    );
}